tap "bufbuild/buf"
tap "grain-lang/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "messense/macos-cross-toolchains"
tap "michaeleisel/zld"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "tinygo-org/tools"
tap "tursodatabase/tap"
tap "universal-ctags/universal-ctags"
tap "wez/wezterm"
# GNU Binutils for aarch64-elf cross development
brew "aarch64-elf-binutils"
# GNU compiler collection for aarch64-elf
brew "aarch64-elf-gcc"
# Run your GitHub Actions locally
brew "act"
# YAML Parser
brew "libyaml"
# Library for command-line editing
brew "readline"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Library for manipulating PNG images
brew "libpng"
# FSF/GNU binutils for cross-compiling to arm-linux
brew "arm-linux-gnueabihf-binutils"
# Spell checker with better logic than ispell
brew "aspell"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# C library implementing the SSH2 protocol
brew "libssh2"
# Regular expressions library
brew "oniguruma"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Parser generator
brew "bison"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Perl compatible regular expressions library with a new API
brew "pcre2"
# C/C++/ObjC language server
brew "ccls"
# Tool to obtain certs from Let's Encrypt and autoenable HTTPS
brew "certbot"
# GNU database manager
brew "gdbm"
# Testing and linting Helm charts
brew "chart-testing"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# Portable Foreign Function Interface library
brew "libffi"
# Generic machine emulator and virtualizer
brew "qemu"
# Linux virtual machines
brew "lima"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Color-highlighted diff(1) output
brew "colordiff"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Tool for browsing source code
brew "cscope"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# POSIX-compliant descendant of NetBSD's ash (the Almquist SHell)
brew "dash"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# File comparison utilities
brew "diffutils"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# XML vocabulary to create presentation-neutral documents
brew "docbook-xsl"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# More intuitive version of du in rust
brew "dust"
# Utility to bundle libraries into executables for macOS
brew "dylibbundler"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
# Run arbitrary commands when files change
brew "entr"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Platform built on V8 to build network applications
brew "node"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Work on GitHub issues on the command-line
brew "ghi"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Small git utilities
brew "git-extras"
# Git extension for versioning large files
brew "git-lfs"
# Render markdown on the CLI
brew "glow"
# Command-line option parsing utility
brew "gnu-getopt"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of time utility
brew "gnu-time"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Slightly more awesome Standard Unix Password Manager for Teams
brew "gopass"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# GitHub Markdown previewer
brew "grip"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Powerful, lightweight programming language
brew "lua"
# Convert source code to formatted text with syntax highlighting
brew "highlight"
# Command-line tools for OpenPGP-related operations
brew "hopenpgp-tools"
# Add GitHub support to git on the command-line
brew "hub"
# Configurable static site generator
brew "hugo"
# Command-line benchmarking tool
brew "hyperfine"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Improved colored diff
brew "icdiff"
# Time series, events, and metrics database
brew "influxdb"
# CLI for managing resources in InfluxDB v2
brew "influxdb-cli"
# C library for encoding, decoding, and manipulating JSON
brew "jansson"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Run local Kubernetes cluster in Docker
brew "kind"
# Network authentication protocol
brew "krb5"
# SDK for building Kubernetes APIs using CRDs
brew "kubebuilder"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Let's Encrypt client and ACME library
brew "lego"
# Pager program similar to more
brew "less"
# Input filter for the pager less
brew "lesspipe"
# Asynchronous event library
brew "libev"
# C implementation of a Sass compiler
brew "libsass"
# Library for processing keyboard entry from the terminal
brew "libtermkey"
# C library for manipulating Yubico one-time passwords
brew "libyubikey"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Small memory footprint, flexible web-server
brew "lighttpd"
# Powerful, lightweight programming language
brew "lua@5.3"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Swiss Army Knife for macOS
brew "m-cli"
# Utility for directing compilation
brew "make"
# Scalable distributed version control system
brew "mercurial", link: false
# Run a Kubernetes cluster locally
brew "minikube"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Open source relational database management system
brew "mysql"
# Fast, highly customisable system info script
brew "neofetch"
# Parser generator tool and incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Utility for managing network connections
brew "netcat"
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# OCaml package manager
brew "opam"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# PostgreSQL syntax beautifier
brew "pgformatter"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# User-friendly, console-based viewer for Info documents
brew "pinfo"
# Object-relational database system
brew "postgresql@12"
# Object-relational database system
brew "postgresql@14"
# Object-relational database system
brew "postgresql@16"
# Modern replacement for ps written by Rust
brew "procs"
# Show ps output as a tree
brew "pstree"
# Monitor data's progress through a pipe
brew "pv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Cross-platform application and UI framework
brew "qt"
# File browser
brew "ranger"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis"
# Docker registry v2 command-line client
brew "reg"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Utility that provides fast incremental file transfer
brew "rsync"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Modern Day Portscanner
brew "rustscan"
# Rust toolchain installer
brew "rustup-init"
# Wrapper around libsass that helps to create command-line apps
brew "sassc"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# HTTP regression testing and benchmarking utility
brew "siege"
# SOcket CAT: netcat on steroids
brew "socat"
# Source-code syntax highlighter
brew "source-highlight"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Clean C library for processing UTF-8 Unicode data
brew "utf8proc"
# Version control system designed to be a better CVS
brew "subversion"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Open source continuous file synchronization application
brew "syncthing"
# TOML toolkit written in Rust
brew "taplo"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Terminal multiplexer
brew "tmux"
# Modern reverse proxy
brew "traefik"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Source code beautifier
brew "uncrustify"
# Maintained ctags implementation
brew "universal-ctags"
# Google's JavaScript engine
brew "v8"
# Vi 'workalike' with many additional features
brew "vim"
# Web Assembly Binary Toolkit
brew "wabt"
# Standalone JIT-style runtime for WebAssembly, using Cranelift
brew "wasmtime"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Tool for managing your YubiKey configuration
brew "ykman"
# YubiKey personalization library and tool
brew "ykpers"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# The best way of working with Protocol Buffers.
brew "bufbuild/buf/buf"
# Consul
brew "hashicorp/tap/consul"
# Consul Template
brew "hashicorp/tap/consul-template"
# Levant
brew "hashicorp/tap/levant"
# Nomad
brew "hashicorp/tap/nomad"
# Nomad Pack
brew "hashicorp/tap/nomad-pack"
# Vault
brew "hashicorp/tap/vault"
# aarch64 Linux GNU Toolchain
brew "messense/macos-cross-toolchains/aarch64-unknown-linux-gnu"
# x86_64 Linux GNU Toolchain
brew "messense/macos-cross-toolchains/x86_64-unknown-linux-gnu"
# A faster version of ld, Apple's linker
brew "michaeleisel/zld/zld"
# Massdrop Firmware Loader
brew "qmk/qmk/mdloader"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# TinyGo is a Go compiler for small places. Microcontrollers, WebAssembly, and command-line tools. Based on LLVM.
brew "tinygo-org/tools/tinygo"
brew "tursodatabase/tap/turso"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# GPU-accelerated terminal emulator
cask "alacritty"
# Chromium based browser
cask "arc"
# Web browser focusing on privacy
cask "brave-browser"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-dejavu-sans-mono-nerd-font"
# Free monospaced font with programming ligatures
cask "font-fira-code"
cask "font-hack"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-go-nerd-font"
cask "font-input"
# Developer targeted fonts with a high number of glyphs
cask "font-iosevka-nerd-font"
# Typeface made for developers
cask "font-jetbrains-mono"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Monospaced variant of "San Francisco" by Apple
cask "font-sf-mono"
cask "font-source-code-pro"
# Web browser
cask "google-chrome"
# Tools to protect your files
cask "gpg-suite-no-mail"
# Packaged Grain binary, including the compiler, runtime & stdlib
cask "grain"
# Utility to fix grammar errors and style issues in text
cask "grammarly"
# Desktop automation application
cask "hammerspoon"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Ruler app with web-development in mind
cask "linear"
# Screen and video recording software
cask "loom"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk"
# App to write, plan, collaborate, and get organized
cask "notion"
# Cloud storage client
cask "onedrive"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Toolbox companion for QMK Firmware
cask "qmk-toolbox"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Video communication and virtual meeting platform
cask "zoom"
